ROBISDP_20171107.json

{
	"info": {
		"name": "ROBISDP",
		"_postman_id": "99e627e5-50e5-5ae1-f978-5b270f4989ea",
		"description": "",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json"
	},
	"item": [
		{
			"name": "DataSync",
			"description": "",
			"item": [
				{
					"name": "Subscription",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"> \r\n   <soapenv:Body> \r\n      <loc:syncOrderRelation xmlns:loc=\"http://www.csapi.org/schema/parlayx/data/sync/v1_0/local\"> \r\n         <loc:userID> \r\n            <ID>8619800000001</ID> \r\n            <type>0</type> \r\n         </loc:userID> \r\n         <loc:spID>001100</loc:spID> \r\n         <loc:productID>1000000423</loc:productID> \r\n         <loc:serviceID>0011002000001100</loc:serviceID> \r\n         <loc:serviceList>0011002000001100</loc:serviceList> \r\n         <loc:updateType>1</loc:updateType> \r\n         <loc:updateTime>20130723082551</loc:updateTime> \r\n         <loc:updateDesc>Addition</loc:updateDesc> \r\n         <loc:effectiveTime>20130723082551</loc:effectiveTime> \r\n         <loc:expiryTime>20361231160000</loc:expiryTime> \r\n         <loc:extensionInfo> \r\n            <item> \r\n               <key>accessCode</key> \r\n               <value>20086</value> \r\n            </item> \r\n            <item> \r\n               <key>chargeMode</key> \r\n               <value>0</value> \r\n            </item> \r\n            <item> \r\n               <key>MDSPSUBEXPMODE</key> \r\n               <value>1</value> \r\n            </item> \r\n            <item> \r\n               <key>objectType</key> \r\n               <value>1</value> \r\n            </item> \r\n            <item> \r\n               <key>isFreePeriod</key> \r\n               <value>false</value> \r\n            </item> \r\n            <item> \r\n               <key>payType</key> \r\n               <value>0</value> \r\n            </item> \r\n            <item> \r\n               <key>transactionID</key> \r\n               <value>504016000001307231624304170004</value> \r\n            </item> \r\n            <item> \r\n               <key>orderKey</key> \r\n               <value>999000000000000194</value> \r\n            </item> \r\n            <item> \r\n               <key>keyword</key> \r\n               <value>sub</value> \r\n            </item> \r\n            <item> \r\n               <key>cycleEndTime</key> \r\n               <value>20130822160000</value> \r\n            </item> \r\n            <item> \r\n               <key>durationOfGracePeriod</key> \r\n               <value>-1</value> \r\n            </item> \r\n            <item> \r\n               <key>serviceAvailability</key> \r\n               <value>0</value> \r\n            </item> \r\n            <item> \r\n               <key>channelID</key> \r\n               <value>1</value> \r\n            </item> \r\n            <item> \r\n               <key>TraceUniqueID</key> \r\n               <value>504016000001307231624304170005</value> \r\n            </item> \r\n            <item> \r\n               <key>operCode</key> \r\n               <value>zh</value> \r\n            </item> \r\n            <item> \r\n               <key>rentSuccess</key> \r\n               <value>true</value> \r\n            </item> \r\n            <item> \r\n               <key>try</key> \r\n               <value>false</value> \r\n            </item>             \r\n            <item> \r\n               <key>shortMessage</key> \r\n               <value>Hello world.</value> \r\n            </item> \r\n         </loc:extensionInfo> \r\n      </loc:syncOrderRelation> \r\n   </soapenv:Body> \r\n</soapenv:Envelope> \r\n"
						},
						"url": {
							"raw": "http://localhost:8080/robisdp",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8080",
							"path": [
								"robisdp"
							]
						},
						"description": ""
					},
					"response": []
				},
				{
					"name": "Unsubscription",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"> \r\n\t<soapenv:Header>\r\n    \t<requestSOAPHeader xmlns=\"http://www.huawei.com.cn/schema/common/v2_1\">\r\n         <spId>000201</spId> \r\n         <spPassword>e6434ef249df55c7a21a0b45758a39bb</spPassword> \r\n         <serviceId>35000001000001</serviceId> \r\n         <timeStamp>20100731064245</timeStamp> \r\n      </requestSOAPHeader>\r\n    </soapenv:Header>\r\n   <soapenv:Body> \r\n      <ns1:syncOrderRelation xmlns:ns1=\"http://www.csapi.org/schema/parlayx/data/sync/v1_0/local\"> \r\n         <ns1:userID> \r\n            <ID>8619800000001</ID> \r\n            <type>0</type> \r\n         </ns1:userID> \r\n         <ns1:spID>001100</ns1:spID> \r\n         <ns1:productID>1000000423</ns1:productID> \r\n         <ns1:serviceID>0011002000001100</ns1:serviceID> \r\n         <ns1:serviceList>0011002000001100</ns1:serviceList> \r\n         <ns1:updateType>2</ns1:updateType> \r\n         <ns1:updateTime>20130723094953</ns1:updateTime> \r\n         <ns1:updateDesc>Deletion</ns1:updateDesc> \r\n         <ns1:effectiveTime>20130723082551</ns1:effectiveTime> \r\n         <ns1:expiryTime>20130723094952</ns1:expiryTime> \r\n         <ns1:extensionInfo> \r\n            <item> \r\n               <key>updateReason</key> \r\n               <value>1</value> \r\n            </item> \r\n            <item> \r\n               <key>payType</key> \r\n               <value>0</value> \r\n            </item> \r\n            <item> \r\n               <key>transactionID</key> \r\n               <value>504016000001307231748315161003</value> \r\n            </item> \r\n            <item> \r\n               <key>orderKey</key> \r\n               <value>999000000000000194</value> \r\n            </item> \r\n            <item> \r\n               <key>MDSPSUBEXPMODE</key> \r\n               <value>1</value> \r\n            </item> \r\n            <item> \r\n               <key>objectType</key> \r\n               <value>1</value> \r\n            </item> \r\n            <item> \r\n               <key>chargeMode</key> \r\n               <value>0</value> \r\n            </item> \r\n            <item> \r\n               <key>accessCode</key> \r\n               <value>20086</value> \r\n            </item> \r\n            <item> \r\n               <key>keyword</key> \r\n               <value>unsub</value> \r\n            </item> \r\n            <item> \r\n               <key>channelID</key> \r\n               <value>1</value> \r\n            </item> \r\n            <item> \r\n               <key>TraceUniqueID</key> \r\n               <value>504016000001307231748315161006</value> \r\n            </item> \r\n            <item> \r\n               <key>rentSuccess</key> \r\n               <value>true</value> \r\n            </item> \r\n            <item> \r\n               <key>try</key> \r\n               <value>false</value> \r\n            </item> \r\n            <item> \r\n               <key>shortMessage</key> \r\n               <value>Hello world.</value> \r\n            </item> \r\n         </ns1:extensionInfo> \r\n      </ns1:syncOrderRelation> \r\n   </soapenv:Body>\r\n</soapenv:Envelope> \r\n"
						},
						"url": {
							"raw": "http://localhost:8080/robisdp",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8080",
							"path": [
								"robisdp"
							]
						},
						"description": ""
					},
					"response": []
				}
			]
		},
		{
			"name": "SMS",
			"description": "",
			"item": [
				{
					"name": "Push SMS Notification",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"> \r\n   <soapenv:Header> \r\n      <ns1:notifySOAPHeader xmlns:ns1=\"http://www.huawei.com.cn/schema/common/v2_1\"> \r\n         <ns1:spRevId>sdp</ns1:spRevId> \r\n         <ns1:spRevpassword>206D88BB7F3D154B130DD6E1E0B8828B</ns1:spRevpassword> \r\n         <ns1:spId>000201</ns1:spId> \r\n         <ns1:serviceId>35000001000001</ns1:serviceId> \r\n         <ns1:timeStamp>111029084631570</ns1:timeStamp> \r\n         <ns1:linkid>12345678901111</ns1:linkid> \r\n         <ns1:traceUniqueID>100001200101110623021721000011</ns1:traceUniqueID> \r\n      </ns1:notifySOAPHeader> \r\n   </soapenv:Header> \r\n   <soapenv:Body> \r\n      <ns2:notifySmsReception xmlns:ns2=\"http://www.csapi.org/schema/parlayx/sms/notification/v2_2/local\"> \r\n         <ns2:correlator>00001</ns2:correlator> \r\n         <ns2:message> \r\n            <message>Hello world</message> \r\n            <senderAddress>tel:8612312345678</senderAddress> \r\n            <smsServiceActivationNumber>tel:1234501</smsServiceActivationNumber> \r\n            <dateTime>2010-08-09T00:00:00.000+08:00</dateTime> \r\n         </ns2:message> \r\n      </ns2:notifySmsReception> \r\n   </soapenv:Body>  \r\n</soapenv:Envelope>"
						},
						"url": {
							"raw": "http://localhost:8080/robisdp",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8080",
							"path": [
								"robisdp"
							]
						},
						"description": ""
					},
					"response": []
				},
				{
					"name": "Start SMS Notification",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"> \r\n   <soapenv:Header/> \r\n   <soapenv:Body> \r\n      <ns2:startSms xmlns:ns2=\"http://www.csapi.org/schema/parlayx/sms/notification/v2_2/local\"> \r\n      </ns2:startSms> \r\n   </soapenv:Body>  \r\n</soapenv:Envelope>"
						},
						"url": {
							"raw": "http://localhost:8080/robisdp",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8080",
							"path": [
								"robisdp"
							]
						},
						"description": ""
					},
					"response": []
				},
				{
					"name": "Stop SMS Notification",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"> \r\n   <soapenv:Header/> \r\n   <soapenv:Body> \r\n      <ns2:stopSms xmlns:ns2=\"http://www.csapi.org/schema/parlayx/sms/notification/v2_2/local\"> \r\n      </ns2:stopSms> \r\n   </soapenv:Body>  \r\n</soapenv:Envelope>"
						},
						"url": {
							"raw": "http://localhost:8080/robisdp",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8080",
							"path": [
								"robisdp"
							]
						},
						"description": ""
					},
					"response": []
				}
			]
		},
		{
			"name": "Test",
			"description": "",
			"item": [
				{
					"name": "Update Employee",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\"?>\n<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <SOAP-ENV:Header>\n    \t<auth:authentication xmlns:auth=\"https://memorynotfound.com/security\">\n         <auth:username>username</auth:username>\n         <auth:password>password</auth:password>\n      </auth:authentication>\n    </SOAP-ENV:Header>\n    <SOAP-ENV:Body>\n        <ns2:updateEmployeeRequest xmlns:ns2=\"robi_sdp\">\n            <ns2:id>1</ns2:id>\n            <ns2:name>Saikat</ns2:name>\n            <ns2:email>saikat@gmail.com</ns2:email>\n            <ns2:height>5.09</ns2:height>\n        </ns2:updateEmployeeRequest>\n    </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>"
						},
						"url": {
							"raw": "http://localhost:8080/sdp",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8080",
							"path": [
								"sdp"
							]
						},
						"description": ""
					},
					"response": []
				},
				{
					"name": "Add Employee",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\"?>\n<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <SOAP-ENV:Header/>\n    <SOAP-ENV:Body>\n        <ns2:addEmployeeRequest xmlns:ns2=\"robi_sdp\">\n        \t<ns2:name>Atiq</ns2:name>\n        \t<ns2:age>30</ns2:age>\n        \t<ns2:height>6.00</ns2:height>\n        \t<ns2:car>\n        \t\t<id>1250</id>\n        \t\t<name>Nissan</name>\n        \t\t<model></model>\n        \t</ns2:car>\n        </ns2:addEmployeeRequest>\n    </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>"
						},
						"url": {
							"raw": "http://localhost:8080/robisdp",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8080",
							"path": [
								"robisdp"
							]
						},
						"description": ""
					},
					"response": []
				},
				{
					"name": "Get All Employee",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\"?>\n<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <SOAP-ENV:Header/>\n    <SOAP-ENV:Body>\n        <ns2:getAllEmployeeRequest xmlns:ns2=\"robi_sdp\">\n        </ns2:getAllEmployeeRequest>\n    </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>"
						},
						"url": {
							"raw": "http://localhost:8080/robisdp",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8080",
							"path": [
								"robisdp"
							]
						},
						"description": ""
					},
					"response": []
				},
				{
					"name": "Get Employee",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\"?>\n<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <SOAP-ENV:Header>\n    \t<auth:authentication xmlns:auth=\"https://memorynotfound.com/security\">\n         <auth:username>username</auth:username>\n         <auth:password>password</auth:password>\n      </auth:authentication>\n    </SOAP-ENV:Header>\n    <SOAP-ENV:Body>\n        <ns2:getEmployeeRequest xmlns:ns2=\"robi_sdp\">\n        \t<ns2:id>2</ns2:id>\n        </ns2:getEmployeeRequest>\n    </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>"
						},
						"url": {
							"raw": "http://localhost:9090/sdp",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "9090",
							"path": [
								"sdp"
							]
						},
						"description": ""
					},
					"response": []
				}
			]
		}
	]
}